var ctx = document.getElementById('myChart').getContext('2d');

        // Создаем данные для диаграммы
        var data = {
            labels: ['Airdrop 0.5%', 'ICO 2.5%', 'Благотворительность 5%', 'Реферальная программа 7%', 'Маркетинг 15%', 'Ставка 20%', 'Резервной фонд 25%', 'Пул ликвидности 20%', 'Разработчики 5%'],
            datasets: [{
                label: 'Мой график',
                data: [0.5, 2.5, 5, 7, 15, 20, 25, 20, 5],
                backgroundColor: [
                    'rgba(255, 0, 0, 0.7)',          // Airdrop 0.5%
                    'rgba(173, 216, 230, 0.7)',      // ICO 2.5%
                    'rgba(0, 0, 255, 0.7)',          // Благотворительность 5%
                    'rgba(255, 192, 203, 0.7)',      // Реферальная программа 7%
                    'rgba(255, 182, 193, 0.7)',      // Маркетинг 15%
                    'rgba(139, 0, 0, 0.7)',          // Ставка 20%
                    'rgba(255, 165, 0, 0.7)',        // Резервной фонд 25%
                    'rgba(255, 255, 255, 0.7)',      // Пул ликвидности 20%
                    'rgba(0, 128, 0, 0.7)'           // Разработчики 5%
                ],
                borderColor: [
                    'red', 'lightblue', 'blue', 'pink', 'lightpink', 'darkred', 'orange', 'white', 'green'
                ],
                borderWidth: 1
            }]
        };

        // Создаем круговую диаграмму
        var myChart = new Chart(ctx, {
            type: 'pie',
            data: data,
            options: {
                // Параметры диаграммы, например, заголовок
                title: {
                    display: true,
                    text: 'Распределение ресурсов'
                }
            }
        });